Revit 2026 API

# DocumentGetRoomAtPoint(XYZ, Phase) Method

---

Gets a room containing the point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room GetRoomAtPoint(
	XYZ point,
	Phase phase
)
```
```vb
Public Function GetRoomAtPoint (
	point As XYZ,
	phase As Phase
) As Room
```
```cpp
public:
Room^ GetRoomAtPoint(
	XYZ^ point,
	Phase^ phase
)
```
```fsharp
member GetRoomAtPoint :
        point : XYZ *
        phase : Phase -> Room
```

#### Parameters

point XYZ
    Point to be checked.
phase Phase
    Phase in which the room exists.

#### Return Value

RoomThe room containing the point.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

If phase is , it will get the room of the last phase.The first one found will be returned. If there is no room containing the point, it returns .

#### Reference

Document Class

GetRoomAtPoint Overload

Autodesk.Revit.DB Namespace